In [2]:
import pandas as pd

In [36]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [28]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [59]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [13]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [14]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

## LOC

In [16]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [19]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [20]:
df.loc['l1', 'c2']

2

In [34]:
df.loc[df['c1'] == 5, 'c2'] = 10 ## procura pela filtragem do primeiro elemento mas altera no segundo elemento que passar -- COLUNAS

In [35]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2  10  10  10  10
l3   8  10  11  12
l4  13  14  15  16

In [23]:
df.iloc[0,3]

4

In [37]:
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   8
l1   4   1

In [39]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [40]:
df.iloc[ [2,0],[3,0] ]

    c4  c1
l3  12   8
l1   4   1

## Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade, nesta ordem.

In [42]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [75]:
df_reprovados = alunos[alunos['Aprovado'] == False][['Nome', 'Sexo', 'Idade']] # filtrando dados e escolhendo quais colunas vir

In [64]:
df_reprovados.index = range(df_reprovados.shape[0])

In [71]:
df_reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [72]:
df_reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

## Crie uma visualização com os três alunos mais novos.

In [81]:
alunos.sort_values(by = ['Idade'], inplace=True)

In [91]:
alunos.sort_index(inplace=True)

In [92]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [95]:
alunos.iloc[:3]

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
1  Cátia     27    F    2.5     False
2  Denis     56    M    5.0     False